; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p4---int100n150-m25---int100c150---s73---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level6 level6)
(sum level0 level9 level9)
(sum level0 level11 level11)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level6 level7)
(sum level1 level9 level10)
(sum level1 level11 level12)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level6 level8)
(sum level2 level9 level11)
(sum level2 level11 level13)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level6 level9)
(sum level3 level9 level12)
(sum level3 level11 level14)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level6 level10)
(sum level4 level9 level13)
(sum level4 level11 level15)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level6 level11)
(sum level5 level9 level14)
(sum level5 level11 level16)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level6 level12)
(sum level6 level9 level15)
(sum level6 level11 level17)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level6 level13)
(sum level7 level9 level16)
(sum level7 level11 level18)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level6 level14)
(sum level8 level9 level17)
(sum level8 level11 level19)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level6 level15)
(sum level9 level9 level18)
(sum level9 level11 level20)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level6 level16)
(sum level10 level9 level19)
(sum level10 level11 level21)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level6 level17)
(sum level11 level9 level20)
(sum level11 level11 level22)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level6 level18)
(sum level12 level9 level21)
(sum level12 level11 level23)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level6 level19)
(sum level13 level9 level22)
(sum level13 level11 level24)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level6 level20)
(sum level14 level9 level23)
(sum level14 level11 level25)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level6 level21)
(sum level15 level9 level24)
(sum level15 level11 level26)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level6 level22)
(sum level16 level9 level25)
(sum level16 level11 level27)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level6 level23)
(sum level17 level9 level26)
(sum level17 level11 level28)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level6 level24)
(sum level18 level9 level27)
(sum level18 level11 level29)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level6 level25)
(sum level19 level9 level28)
(sum level19 level11 level30)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level6 level26)
(sum level20 level9 level29)
(sum level20 level11 level31)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level6 level27)
(sum level21 level9 level30)
(sum level21 level11 level32)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level6 level28)
(sum level22 level9 level31)
(sum level22 level11 level33)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level6 level29)
(sum level23 level9 level32)
(sum level23 level11 level34)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level6 level30)
(sum level24 level9 level33)
(sum level24 level11 level35)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level6 level31)
(sum level25 level9 level34)
(sum level25 level11 level36)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level6 level32)
(sum level26 level9 level35)
(sum level26 level11 level37)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level6 level33)
(sum level27 level9 level36)
(sum level27 level11 level38)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level6 level34)
(sum level28 level9 level37)
(sum level28 level11 level39)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level6 level35)
(sum level29 level9 level38)
(sum level29 level11 level40)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level6 level36)
(sum level30 level9 level39)
(sum level30 level11 level41)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level6 level37)
(sum level31 level9 level40)
(sum level31 level11 level42)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level6 level38)
(sum level32 level9 level41)
(sum level32 level11 level43)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level6 level39)
(sum level33 level9 level42)
(sum level33 level11 level44)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level6 level40)
(sum level34 level9 level43)
(sum level34 level11 level45)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level6 level41)
(sum level35 level9 level44)
(sum level35 level11 level46)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level6 level42)
(sum level36 level9 level45)
(sum level36 level11 level47)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level6 level43)
(sum level37 level9 level46)
(sum level37 level11 level48)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level6 level44)
(sum level38 level9 level47)
(sum level38 level11 level49)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level6 level45)
(sum level39 level9 level48)
(sum level39 level11 level50)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level6 level46)
(sum level40 level9 level49)
(sum level40 level11 level51)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level6 level47)
(sum level41 level9 level50)
(sum level41 level11 level52)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level6 level48)
(sum level42 level9 level51)
(sum level42 level11 level53)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level6 level49)
(sum level43 level9 level52)
(sum level43 level11 level54)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level6 level50)
(sum level44 level9 level53)
(sum level44 level11 level55)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level6 level51)
(sum level45 level9 level54)
(sum level45 level11 level56)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level6 level52)
(sum level46 level9 level55)
(sum level46 level11 level57)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level6 level53)
(sum level47 level9 level56)
(sum level47 level11 level58)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level6 level54)
(sum level48 level9 level57)
(sum level48 level11 level59)
(sum level48 level16 level64)
(sum level48 level17 level65)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level6 level55)
(sum level49 level9 level58)
(sum level49 level11 level60)
(sum level49 level16 level65)
(sum level49 level17 level66)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level6 level56)
(sum level50 level9 level59)
(sum level50 level11 level61)
(sum level50 level16 level66)
(sum level50 level17 level67)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level6 level57)
(sum level51 level9 level60)
(sum level51 level11 level62)
(sum level51 level16 level67)
(sum level51 level17 level68)
(sum level51 level25 level76)
(sum level52 level1 level53)
(sum level52 level6 level58)
(sum level52 level9 level61)
(sum level52 level11 level63)
(sum level52 level16 level68)
(sum level52 level17 level69)
(sum level52 level25 level77)
(sum level53 level1 level54)
(sum level53 level6 level59)
(sum level53 level9 level62)
(sum level53 level11 level64)
(sum level53 level16 level69)
(sum level53 level17 level70)
(sum level53 level25 level78)
(sum level54 level1 level55)
(sum level54 level6 level60)
(sum level54 level9 level63)
(sum level54 level11 level65)
(sum level54 level16 level70)
(sum level54 level17 level71)
(sum level54 level25 level79)
(sum level55 level1 level56)
(sum level55 level6 level61)
(sum level55 level9 level64)
(sum level55 level11 level66)
(sum level55 level16 level71)
(sum level55 level17 level72)
(sum level55 level25 level80)
(sum level56 level1 level57)
(sum level56 level6 level62)
(sum level56 level9 level65)
(sum level56 level11 level67)
(sum level56 level16 level72)
(sum level56 level17 level73)
(sum level56 level25 level81)
(sum level57 level1 level58)
(sum level57 level6 level63)
(sum level57 level9 level66)
(sum level57 level11 level68)
(sum level57 level16 level73)
(sum level57 level17 level74)
(sum level57 level25 level82)
(sum level58 level1 level59)
(sum level58 level6 level64)
(sum level58 level9 level67)
(sum level58 level11 level69)
(sum level58 level16 level74)
(sum level58 level17 level75)
(sum level58 level25 level83)
(sum level59 level1 level60)
(sum level59 level6 level65)
(sum level59 level9 level68)
(sum level59 level11 level70)
(sum level59 level16 level75)
(sum level59 level17 level76)
(sum level59 level25 level84)
(sum level60 level1 level61)
(sum level60 level6 level66)
(sum level60 level9 level69)
(sum level60 level11 level71)
(sum level60 level16 level76)
(sum level60 level17 level77)
(sum level60 level25 level85)
(sum level61 level1 level62)
(sum level61 level6 level67)
(sum level61 level9 level70)
(sum level61 level11 level72)
(sum level61 level16 level77)
(sum level61 level17 level78)
(sum level61 level25 level86)
(sum level62 level1 level63)
(sum level62 level6 level68)
(sum level62 level9 level71)
(sum level62 level11 level73)
(sum level62 level16 level78)
(sum level62 level17 level79)
(sum level62 level25 level87)
(sum level63 level1 level64)
(sum level63 level6 level69)
(sum level63 level9 level72)
(sum level63 level11 level74)
(sum level63 level16 level79)
(sum level63 level17 level80)
(sum level64 level1 level65)
(sum level64 level6 level70)
(sum level64 level9 level73)
(sum level64 level11 level75)
(sum level64 level16 level80)
(sum level64 level17 level81)
(sum level65 level1 level66)
(sum level65 level6 level71)
(sum level65 level9 level74)
(sum level65 level11 level76)
(sum level65 level16 level81)
(sum level65 level17 level82)
(sum level66 level1 level67)
(sum level66 level6 level72)
(sum level66 level9 level75)
(sum level66 level11 level77)
(sum level66 level16 level82)
(sum level66 level17 level83)
(sum level67 level1 level68)
(sum level67 level6 level73)
(sum level67 level9 level76)
(sum level67 level11 level78)
(sum level67 level16 level83)
(sum level67 level17 level84)
(sum level68 level1 level69)
(sum level68 level6 level74)
(sum level68 level9 level77)
(sum level68 level11 level79)
(sum level68 level16 level84)
(sum level68 level17 level85)
(sum level69 level1 level70)
(sum level69 level6 level75)
(sum level69 level9 level78)
(sum level69 level11 level80)
(sum level69 level16 level85)
(sum level69 level17 level86)
(sum level70 level1 level71)
(sum level70 level6 level76)
(sum level70 level9 level79)
(sum level70 level11 level81)
(sum level70 level16 level86)
(sum level70 level17 level87)
(sum level71 level1 level72)
(sum level71 level6 level77)
(sum level71 level9 level80)
(sum level71 level11 level82)
(sum level71 level16 level87)
(sum level72 level1 level73)
(sum level72 level6 level78)
(sum level72 level9 level81)
(sum level72 level11 level83)
(sum level73 level1 level74)
(sum level73 level6 level79)
(sum level73 level9 level82)
(sum level73 level11 level84)
(sum level74 level1 level75)
(sum level74 level6 level80)
(sum level74 level9 level83)
(sum level74 level11 level85)
(sum level75 level1 level76)
(sum level75 level6 level81)
(sum level75 level9 level84)
(sum level75 level11 level86)
(sum level76 level1 level77)
(sum level76 level6 level82)
(sum level76 level9 level85)
(sum level76 level11 level87)
(sum level77 level1 level78)
(sum level77 level6 level83)
(sum level77 level9 level86)
(sum level78 level1 level79)
(sum level78 level6 level84)
(sum level78 level9 level87)
(sum level79 level1 level80)
(sum level79 level6 level85)
(sum level80 level1 level81)
(sum level80 level6 level86)
(sum level81 level1 level82)
(sum level81 level6 level87)
(sum level82 level1 level83)
(sum level83 level1 level84)
(sum level84 level1 level85)
(sum level85 level1 level86)
(sum level86 level1 level87)

(connected l0 l3)
(fuelcost level25 l0 l3)
(connected l0 l4)
(fuelcost level9 l0 l4)
(connected l0 l6)
(fuelcost level1 l0 l6)
(connected l1 l3)
(fuelcost level17 l1 l3)
(connected l1 l4)
(fuelcost level16 l1 l4)
(connected l1 l5)
(fuelcost level16 l1 l5)
(connected l2 l3)
(fuelcost level6 l2 l3)
(connected l2 l6)
(fuelcost level16 l2 l6)
(connected l3 l0)
(fuelcost level25 l3 l0)
(connected l3 l1)
(fuelcost level17 l3 l1)
(connected l3 l2)
(fuelcost level6 l3 l2)
(connected l3 l4)
(fuelcost level11 l3 l4)
(connected l4 l0)
(fuelcost level9 l4 l0)
(connected l4 l1)
(fuelcost level16 l4 l1)
(connected l4 l3)
(fuelcost level11 l4 l3)
(connected l5 l1)
(fuelcost level16 l5 l1)
(connected l5 l6)
(fuelcost level16 l5 l6)
(connected l6 l0)
(fuelcost level1 l6 l0)
(connected l6 l2)
(fuelcost level16 l6 l2)
(connected l6 l5)
(fuelcost level16 l6 l5)

(at t0 l3)
(fuel t0 level87)
(= (total-cost) 0)

(at p0 l4)
(at p1 l4)
(at p2 l6)
(at p3 l2)
)

(:goal
(and
(at p0 l5)
(at p1 l0)
(at p2 l4)
(at p3 l5)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l3 l2 level81 level6 level87)
   deleted: (at t0 l3) (fuel t0 level87)
   added: (at t0 l2) (fuel t0 level81)
   goals met: 0 of 4
2. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 4
3. (drive t0 l2 l6 level65 level16 level81)
   deleted: (at t0 l2) (fuel t0 level81)
   added: (at t0 l6) (fuel t0 level65)
   goals met: 0 of 4
4. (load p2 t0 l6)
   deleted: (at p2 l6)
   added: (in p2 t0)
   goals met: 0 of 4
5. (drive t0 l6 l0 level64 level1 level65)
   deleted: (at t0 l6) (fuel t0 level65)
   added: (at t0 l0) (fuel t0 level64)
   goals met: 0 of 4
6. (drive t0 l0 l4 level55 level9 level64)
   deleted: (at t0 l0) (fuel t0 level64)
   added: (at t0 l4) (fuel t0 level55)
   goals met: 0 of 4
7. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 0 of 4
8. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 0 of 4
9. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 1 of 4
10. (drive t0 l4 l0 level46 level9 level55)
   deleted: (at t0 l4) (fuel t0 level55)
   added: (at t0 l0) (fuel t0 level46)
   goals met: 1 of 4
11. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 2 of 4
12. (drive t0 l0 l6 level45 level1 level46)
   deleted: (at t0 l0) (fuel t0 level46)
   added: (at t0 l6) (fuel t0 level45)
   goals met: 2 of 4
13. (drive t0 l6 l5 level29 level16 level45)
   deleted: (at t0 l6) (fuel t0 level45)
   added: (at t0 l5) (fuel t0 level29)
   goals met: 2 of 4
14. (unload p0 t0 l5)
   deleted: (in p0 t0)
   added: (at p0 l5)
   goals met: 3 of 4
15. (unload p3 t0 l5)
   deleted: (in p3 t0)
   added: (at p3 l5)
   goals met: 4 of 4
